Tekla Open API Reference for Tekla Structures 2025
IUIEvents Methods
The IUIEvents type exposes the following members.
Methods
Name | Description
OnInterrupted
 Called when uesr interrupts.
Register
 Registers the instance to listen to the specified events.
UnRegister
 Unregisters the instance from listening to events.
Top
See Also
Reference
IUIEvents Interface
Tekla.Structures.Drawing.UI Namespace